In [1]:
#PANDAS PRACTICE

#SERIES
#import libraries
import numpy as np
import pandas as pd

In [3]:
#Defining list, array and dictionary
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':100}

In [5]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_list,labels)     #changing index to labels list

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr)             #Making a series out of the numpy array

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series(arr,labels)      #Making a series out of array with labels

a    10
b    20
c    30
dtype: int32

In [10]:
pd.Series(d)              #Series out of a dictionary

a     10
b     20
c    100
dtype: int64

In [11]:
pd.Series(data=labels)   #Interchanging labels and data

0    a
1    b
2    c
dtype: object

In [12]:
pd.Series([sum,print,len])   #Passing in built functions to a Series, might not be used but functionality is there

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [14]:
ser1=pd.Series([1,2,3,4],index=['US','FR','GR','EN'])  #Creating Series with index
ser1

US    1
FR    2
GR    3
EN    4
dtype: int64

In [15]:
ser2=pd.Series([10,20,30,40],index=['US','IN','GR','JP'])  #Creating new series
ser2

US    10
IN    20
GR    30
JP    40
dtype: int64

In [17]:
ser1+ser2     #Adding Series, common have value, which are not there got their values changed to NaN

EN     NaN
FR     NaN
GR    33.0
IN     NaN
JP     NaN
US    11.0
dtype: float64

In [20]:
#DATAFRAMES
#import libraries numpy and pd already imported above
from numpy.random import randn

In [21]:
np.random.seed(101)  #Declaring seed to make results device & time independent

In [22]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])   #W,X,Y,Z are series and they share a common index A,B,C,D,E
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df['W']  #Grabbing W column from the dataframe

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [24]:
type(df['W'])   #The type will be shown as a series, when we take a column from a dataframe

pandas.core.series.Series

In [25]:
type(df)        #Type of df object is dataframe

pandas.core.frame.DataFrame

In [26]:
df.W            #Another way to grab a column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [28]:
df[['W','Z']]   #Displaying two columns out of df

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [30]:
df['new']=df['X']+df['Y']  #Creating a new col by adding two other columns
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [35]:
df.drop('new',axis=1)   #Dropping a column, axis 1 means column. Axis 0 means row which is by default but it will give error

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df #The original df will still retain the new column

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [38]:
df.drop('new',axis=1,inplace=True)  #To make the change persist in df as well inplace=True
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df.drop('E')    #Dropping E row. The axis is 0 by default so we don't have to explicitely specify

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [42]:
df[['W','Z']]   #Selecting Columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [43]:
#Selecting rows
df.loc['A']    #The row is returned as a series with columns as labels

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [44]:
df.iloc[0]   #Another way to select row by numerical based index

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [46]:
df.loc['A','Z'] #grabbing a specific value from dataframe by loc row and col labels

0.5038257538223936

In [48]:
df.iloc[0,3]    #grabbing a specific value from dataframe by iloc integer based index

0.5038257538223936

In [49]:
df.loc[['A','B'],['Y','Z']]  #Grabbing a subset of array

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [50]:
df  #Initial Dataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df > 0    #We get boolean value as output when we do a comparison operation on the dataframe

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [53]:
booldf=df>0 #Getting the boolean values in booldf

In [55]:
df[booldf]  #Prints where booldf is true for the df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df[df>0]    #using the comparison directly with the df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
 df['W']>0   #Comparing a column returns a series

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [58]:
df[df['W']>0]    #Filtering with condition, since for C row it is false it will not appear in the df output

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
df[df['Z']<0]  #Row C is returned because that is the only place where Col Z is less than 0

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [60]:
resultdf=df[df['W']>0]   #This will return a subset and store it

In [61]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [62]:
resultdf['X']    #Accessing only X column from the new subset

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [64]:
df[df['W']>0]['X']  #Combining the above steps into one

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [65]:
boolser=df['W']>0
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [66]:
df[boolser]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
df[boolser][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [76]:
df[df['W']>0][['X','Y']]   #One liner same as above step

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [78]:
df[(df['W']>0) & (df['X']>0)] #and conditions note: don't use 'and' but use '&' instead

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [81]:
df[(df['W']<0) | (df['X']>0)]  #Or condition note: don't use 'or' but use '|' instead because we are dealing with series

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [84]:
df   #initial df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [85]:
df.reset_index()   #Resetting index of df, notice that index is reset as a column

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [92]:
newind='CA NY CO CT NJ'.split()  #Splitting a string

In [93]:
newind

['CA', 'NY', 'CO', 'CT', 'NJ']

In [94]:
df['States']=newind   #Creating a new col

In [95]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     CO
D  0.188695 -0.758872 -0.933237  0.955057     CT
E  0.190794  1.978757  2.605967  0.683509     NJ

In [96]:
df.set_index('States')   #df states

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
CO     -2.018168  0.740122  0.528813 -0.589001
CT      0.188695 -0.758872 -0.933237  0.955057
NJ      0.190794  1.978757  2.605967  0.683509

In [98]:
df            #To persist use inplace=True

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     CO
D  0.188695 -0.758872 -0.933237  0.955057     CT
E  0.190794  1.978757  2.605967  0.683509     NJ

In [99]:
#Index Levels
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [100]:
hier_index=pd.MultiIndex.from_tuples(hier_index)   #Creating a multi level index
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [103]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])    #6 rows 2 col of rand normal, adding multilevel index and Col header A and B
df

             A         B
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [104]:
df.loc['G1']   # Selecting G1 Rows from level 1

          A         B
1  1.025984 -0.156598
2 -0.031579  0.649826
3  2.154846 -0.610259

In [113]:
df.loc['G1'].loc[2]   #Selecting 2 row inside G1 level 2

A   -0.031579
B    0.649826
Name: 2, dtype: float64

In [115]:
df.index.names     #Current name of these index

FrozenList([None, None])

In [116]:
df.index.names=['Groups','Numbers']   #Assigning name to index
df

                       A         B
Groups Numbers
G1     1        1.025984 -0.156598
       2       -0.031579  0.649826
       3        2.154846 -0.610259
G2     1       -0.755325 -0.346419
       2        0.147027 -0.479448
       3        0.558769  1.024810

In [118]:
df.loc['G2'].loc[2]['B'] #Grab value present at index G2, 2 and B Column

-0.47944803904109595

In [119]:
df.xs('G1')  #Cross-section function, it can go inside a multi level index

                A         B
Numbers
1        1.025984 -0.156598
2       -0.031579  0.649826
3        2.154846 -0.610259

In [120]:
df.xs(1,level='Numbers')   #Numbers Index

               A         B
Groups
G1      1.025984 -0.156598
G2     -0.755325 -0.346419

In [121]:
#Missing Data

In [128]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[9,0,9]}

In [129]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [9, 0, 9]}

In [130]:
df=pd.DataFrame(d)

In [131]:
df

     A    B  C
0  1.0  5.0  9
1  2.0  NaN  0
2  NaN  NaN  9

In [132]:
df.dropna()

     A    B  C
0  1.0  5.0  9

In [133]:
df

     A    B  C
0  1.0  5.0  9
1  2.0  NaN  0
2  NaN  NaN  9

In [134]:
df.dropna(axis=1)   #Dropping and and selecting col

   C
0  9
1  0
2  9

In [135]:
df.dropna(thresh=2)  #Setting a threshold of two nan values

     A    B  C
0  1.0  5.0  9
1  2.0  NaN  0

In [136]:
df.fillna(value='FILL')  #Filling some value for NAN

      A     B  C
0     1     5  9
1     2  FILL  0
2  FILL  FILL  9

In [140]:
df.A

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [141]:
df.A.fillna(value=df['A'].mean())   #Mean of values in place of NA

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [142]:
#Group By

In [151]:
data ={'Company':['Google','Google','Apple','Amazon','Netflix','Netflix'],
      'Person':['Zee','Ysh','Ang','Shr','Gwn','Jon'],
      'Sales':[200,120,340,124,243,350]}

In [152]:
data

{'Company': ['Google', 'Google', 'Apple', 'Amazon', 'Netflix', 'Netflix'],
 'Person': ['Zee', 'Ysh', 'Ang', 'Shr', 'Gwn', 'Jon'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [153]:
df=pd.DataFrame(data)
df

   Company Person  Sales
0   Google    Zee    200
1   Google    Ysh    120
2    Apple    Ang    340
3   Amazon    Shr    124
4  Netflix    Gwn    243
5  Netflix    Jon    350

In [154]:
byComp=df.groupby('Company')

In [155]:
byComp.mean() #Mean by company

         Sales
Company
Amazon   124.0
Apple    340.0
Google   160.0
Netflix  296.5

In [156]:
byComp.sum() #Sum by company

         Sales
Company
Amazon     124
Apple      340
Google     320
Netflix    593

In [157]:
byComp.count()  #Count

         Person  Sales
Company
Amazon        1      1
Apple         1      1
Google        2      2
Netflix       2      2

In [158]:
df.groupby('Company').describe()  #Summary statistics

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
Amazon    1.0  124.0        NaN  124.0  124.00  124.0  124.00  124.0
Apple     1.0  340.0        NaN  340.0  340.00  340.0  340.00  340.0
Google    2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0
Netflix   2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

In [159]:
df.groupby('Company').describe().transpose()   #Transpose

Company      Amazon  Apple      Google     Netflix
Sales count     1.0    1.0    2.000000    2.000000
      mean    124.0  340.0  160.000000  296.500000
      std       NaN    NaN   56.568542   75.660426
      min     124.0  340.0  120.000000  243.000000
      25%     124.0  340.0  140.000000  269.750000
      50%     124.0  340.0  160.000000  296.500000
      75%     124.0  340.0  180.000000  323.250000
      max     124.0  340.0  200.000000  350.000000

In [160]:
df.groupby('Company').describe().transpose()['Google']   #Getting info for single company

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: Google, dtype: float64

In [168]:
df1=pd.DataFrame({'A':['A0','A1'],'B':['B0','B1']},index=[0,1])

In [169]:
df2=pd.DataFrame({'A':['A2','A3'],'B':['B2','B3']},index=[2,3])

In [170]:
df3=pd.DataFrame({'A':['A4','A5'],'B':['B4','B5']},index=[4,5])

In [171]:
df1

    A   B
0  A0  B0
1  A1  B1

In [172]:
df2

    A   B
2  A2  B2
3  A3  B3

In [173]:
df3

    A   B
4  A4  B4
5  A5  B5

In [174]:
pd.concat([df1,df2,df3])   #Concatonation

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5

In [175]:
pd.concat([df1,df2,df3],axis=1)#Column wise concotonation

     A    B    A    B    A    B
0   A0   B0  NaN  NaN  NaN  NaN
1   A1   B1  NaN  NaN  NaN  NaN
2  NaN  NaN   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4
5  NaN  NaN  NaN  NaN   A5   B5

In [176]:
left=pd.DataFrame({'A':['A0','A1','A2'],'B':['B1','B2','B3'],'Key':['H0','H1','H2']})

In [177]:
right=pd.DataFrame({'C':['C0','C1','C2'],'D':['D1','D2','D3'],'Key':['H0','H1','H2']})

In [178]:
left

    A   B Key
0  A0  B1  H0
1  A1  B2  H1
2  A2  B3  H2

In [179]:
right

    C   D Key
0  C0  D1  H0
1  C1  D2  H1
2  C2  D3  H2

In [181]:
pd.merge(left,right,how="inner",on='Key')  #Merging both dataframes on Key col

    A   B Key   C   D
0  A0  B1  H0  C0  D1
1  A1  B2  H1  C1  D2
2  A2  B3  H2  C2  D3

In [182]:
#Join

In [183]:
left=pd.DataFrame({'A':['A0','A1','A2'],'B':['B0','B1','B2']},index=['K0','K1','K2'])

In [184]:
right=pd.DataFrame({'C':['C0','C2','C3'],'D':['D0','D1','D2']},index=['K0','K2','K3'])

In [186]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [187]:
right

     C   D
K0  C0  D0
K2  C2  D1
K3  C3  D2

In [188]:
left.join(right)   #Joining

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D1

In [189]:
left.join(right,how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D1
K3  NaN  NaN   C3   D2

In [190]:
#Pandas Operations

In [191]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [192]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [193]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [194]:
len(df['col2'].unique())

3

In [195]:
df['col2'].nunique()   #Count of unique same as above operation

3

In [196]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [199]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [201]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [204]:
def times2(x):   #Define a col to use later with df
    return x*2

In [207]:
df['col1'].apply(times2)   #Custom functions can be applied using apply

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [208]:
df['col3'].apply(len)   #Built in functions call

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [210]:
df['col1'].apply(lambda x:x**2)  #Applying lambda to write custom function

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [211]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [212]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [213]:
df.columns   #get list of columnnames

Index(['col1', 'col2', 'col3'], dtype='object')

In [215]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [218]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [220]:
df.pivot_table(values='col2',index='col1',columns=['col3'])

col3    abc    def    ghi    xyz
col1
1     444.0    NaN    NaN    NaN
2       NaN  555.0    NaN    NaN
3       NaN    NaN  666.0    NaN
4       NaN    NaN    NaN  444.0

In [221]:
pwd  #Present working directory

'C:\\Users\\ZEESHAN\\Python Study\\Python Finance\\Python-for-Finance-Repo-master\\02-NumPy'

In [230]:
import os
os.chdir('.\\..\\03- General Pandas')

In [233]:
pd.read_csv("example.csv")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [234]:
df=pd.read_csv("example.csv")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [235]:
df.to_csv('My_output')

In [236]:
pd.read_csv('My_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [237]:
df.to_csv('My_output',index=False)

In [238]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [242]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')   #Reading an excel

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [243]:
df.to_excel('Newout.xlsx',sheet_name='my_sheet')  #Writing excel

In [246]:
pd.read_excel('Newout.xlsx',sheet_name='my_sheet')  #Reading the newly written excel

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [247]:
data=pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [250]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"

In [256]:
from sqlalchemy import create_engine

In [258]:
engine=create_engine('sqlite:///:memory:')

In [259]:
df.to_sql('my_table',engine)   #Writing df to sql as a table

In [260]:
sqldf=pd.read_sql('my_table',con=engine)   #read table from sql

In [262]:
sqldf    #displaying the dataframe extracted from sql table

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15